{"_id":{"$oid":"58b6cdbf3c3e38110029ebe3"},"title":"Dave's ESL Cafe","url":"daves-esl-cafe","user":{"$oid":"575dfe9e86ad7811005d2922"},"pictureUrl":"IMG_20170215_122721.jpg","content":"\u003cp\u003e\u003cstrong\u003e\u003ca href=\"http://www.eslcafe.com/\"\u003eDave Sperling's ESL Cafe\u003c/a\u003e\u003c/strong\u003e was one of the first websites that came up when I looked up the school I was going to work for. The post in question was a long rant from an ex-employee who felt like the management brought foreign teachers under false pretences and took advantage of them. As this seemed like a rather precarious situation to get myself into I tried to find more information about the school on the site and found out that the search function forwarded back to Google. All I wanted to do was to see if there were any other posts on the school that had a different point of view, but navigation on ESL Cafe made that task difficult.\u003c/p\u003e\r\n\u003cp\u003e\u003cbr /\u003eI was later shocked to learn that it is apparently one of if not the reference when it comes to TEFL. Everyone has used it to look for jobs or at least stumbled upon it while looking up schools online. Yet, Dave\u0026rsquo;s ESL Cafe doesn\u0026rsquo;t look like it\u0026rsquo;s been updated since it\u0026rsquo;s creation in 1995 and the way information is organized on the website is not user-friendly. Forums are good for information that doesn\u0026rsquo;t need to be centralized but in the case of TEFL schools and companies, grouping reviews and comments would benefit everyone and improve navigation.\u003c/p\u003e\r\n\u003cp\u003e\u003cbr /\u003eEven the \u003cstrong\u003e\u003ca href=\"http://www.eslcafe.com/students/\"\u003ematerial for students\u003c/a\u003e\u003c/strong\u003e\u0026nbsp;and teachers seems significantly outdated, all it is is a basic list, numbered, with no way of really knowing which one talks about which aspect. Nowadays with the number of websites specializing in teaching English and even more specifically TEFL, TESOL, CELTA, IELTS and others, teachers have made so many resources available in so many different forms (presentations, videos and articles) that a basic static html page hardly seems relevant.\u003c/p\u003e\r\n\u003cp\u003e\u003cbr /\u003eTo finalize this, I would just add that I have nothing against Dave Sperling's work, if anything I think it\u0026rsquo;s great he made so much money out of helping thousands of people to speak English online, it\u0026rsquo;s a noble cause. However, at this point, I am simply surprised there are still so many people turning to such an old website for advice and hope schools and teachers will realize it\u0026rsquo;s time to migrate to newer and more functional sites like \u003cstrong\u003e\u003ca href=\"../\"\u003eEnglish in China\u003c/a\u003e\u003c/strong\u003e or \u003cstrong\u003e\u003ca href=\"https://www.gooverseas.com/\"\u003eGo Overseas\u003c/a\u003e\u003c/strong\u003e.\u003c/p\u003e","kicker":"Harder, Better, Faster, Stronger","dateCreated":{"$date":"2017-03-01T13:33:51.814Z"},"__v":0}
{"_id":{"$oid":"58b6ce6e3c3e38110029ebe5"},"title":"5 Ways to Improve the Situation of TEFL in China","url":"5-ways-to-improve-the-situation-of-tefl-in-china","user":{"$oid":"575dfe9e86ad7811005d2922"},"pictureUrl":"IMG_20170215_124256.jpg","content":"\u003cp\u003eThe American dream lasted long enough but in the current economical situation, still believing that anyone can come and achieve success is unrealistic. Tables have turned until *someone* makes it great again. China, on the other hand, is still a land of opportunities. Sure, its economy has lost a bit of the momentum it had in the last few years, but it\u0026rsquo;s still a wildly unsaturated market with the largest middle-class to ever come to power. Not to mention it only opened up to globalization fairly recently which has left them with the desire to tackle international business but lacking communication skills in what is considered the international language for business.\u003c/p\u003e\r\n\u003cp\u003eUnsurprisingly, for that very reason, one of the businesses that is still growing astonishingly fast in China is TEFL, or Teach English as a Foreign Language. Large international companies like \u003cstrong\u003e\u003ca href=\"../company/id/584a7c9f2726371100fedc25\"\u003eShane\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003ca href=\"../company/id/58563c3ca506ea1100d8aa2f\"\u003eEF\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003ca href=\"../company/id/58569e5dd72b9511008b062f\"\u003eWEB International\u003c/a\u003e\u003c/strong\u003e, \u003cstrong\u003e\u003ca href=\"../company/id/5856ac94d72b9511008b0648\"\u003eDisney\u003c/a\u003e\u0026nbsp;\u003c/strong\u003eand many more are still planting schools in every corner of the country while entrepreneurs, chinese or otherwise, are trying to reinvent the meaning of education with ever-increasingly interactive and immersive classes where students aren\u0026rsquo;t apparently supposed to realize they\u0026rsquo;re learning.\u003c/p\u003e\r\n\u003cp\u003eAll of that sounds wonderful doesn\u0026rsquo;t it? Unfortunately, TEFL teachers in China know that in reality it\u0026rsquo;s often hit or miss. Even within large companies such as the ones mentioned above, the work environment and management can vary to such an extent that employees working the same job in sister schools will have entirely different experiences. So what could possibly be done to help improve the situation? Here are five suggestion ranging from immediate action amongst colleagues to more long term actions oriented toward helping out future teachers.\u003c/p\u003e\r\n\u003ch3\u003e1) Needle in a\u0026nbsp;haystack\u003c/h3\u003e\r\n\u003cp\u003eWhile this may not apply as much to bigger cities, it is important to realize that in third and second tier cities, foreigners aren\u0026rsquo;t necessarily easy to come by. Unlike our fellow chinese colleagues who often have no choice but to do everything they are told out of fear of being replaced (and because of a large cultural difference of the meaning of leadership, let\u0026rsquo;s be honest), foreigners should use their exclusivity as leverage to help schools understand treating employees like throwaways is no way to motivate their staff. All the better if it can be used to influence how management treats the chinese staff, as they often get the short end of the stick in all of this. If you are a good teacher and have been in a school for a decent amount of time, use that negotiating power.\u003c/p\u003e\r\n\u003ch3\u003e2) Stand\u0026nbsp;together\u003c/h3\u003e\r\n\u003cp\u003eMost training schools employ anywhere from 2\u0026ndash;3 foreign teachers in smaller cities to around 10\u0026ndash;11 in bigger centers. They are an essential part of why parents send their kids to those schools and they provide a way for young learners to listen to native speakers and make sure their English is good enough to be understood by people who speak it everyday. Understanding that those schools couldn\u0026rsquo;t reach the level of success they have without the presence of foreign teachers is important. They are undoubtedly the heart and soul of the TEFL business.\u003c/p\u003e\r\n\u003cp\u003eWhat does that all have to do with improving the situation? Well, if all the foreign staff stands together in trying to discuss certain issues with the management, it will leave a stronger impression and there\u0026rsquo;s a better chance that requests will be taken seriously. With this aim in mind, teachers could set a meeting to discuss issues on a weekly basis, not doing so and waiting until they become urgent before raising a flag will create unnecessary commotion and lead to them staying unresolved. Training schools often have more office hours than teachers know what to do of, arranging such a meeting while teachers are already forced to be in their offices shouldn\u0026rsquo;t affect anyone\u0026rsquo;s workload.\u003c/p\u003e\r\n\u003ch3\u003e3) Responsibilize teachers\u003c/h3\u003e\r\n\u003cp\u003eForeign teachers are the heart of the TEFL business, but most training schools often wish they weren\u0026rsquo;t. They are expensive, needy, have high living and working standards and are hard to communicate with. Also, they often have no decisional power. In certain schools I worked for, the head foreign teacher title was just a label. The general attitude in those schools after a while was of complete derision, no one cared about the quality of their classes because they often felt like they weren\u0026rsquo;t given any respect. But then I got a job in a high school and later in a university where I was given complete control over my classes and suddenly it was the complete opposite. I could work on the curriculum, plan lessons, activities, focus on specific aspects of the language, I was a real teacher instead of a glorified babysitter. And everyone around me had designed their own style of teaching and built a solid curriculum.\u003c/p\u003e\r\n\u003cp\u003eIf teachers were given more responsibility in training schools they would feel respected, and empowered, they would rise to the challenge. There is a common misconception that teachers aren\u0026rsquo;t capable of handling hard work, but in reality they often just reflect the amount of respect and professionalism the schools warrants.\u003c/p\u003e\r\n\u003ch3\u003e4) Organization and Professionalism\u003c/h3\u003e\r\n\u003cp\u003eIn my personal experience working in Canada, organization and professionalism have always been core values. Most companies try to the best of their capacity to organise holidays, activities, meetings and other such related matters in a timely manner and would apologize if mistakes were made or time were changed as well as make sure a meeting would be held to communicate the information. The first impression I got from working in training schools in China was that nothing was ever set in stone and important matters were decided at the last minute. For instance, off-time for holidays were often revealed two weeks beforehand, quite late for buying long-distance plane tickets or planning an itinerary, or extra classes would be given to teachers a few hours before they are supposed to start (good classes require lesson planning). So this advice goes more to schools themselves than teachers, but in order for teachers to enjoy their experience working for a school it\u0026rsquo;s necessary that they can count on the school keeping their word as well as showing some vision when it comes to organizing holidays and other matters.\u003c/p\u003e\r\n\u003ch3\u003e5) Populate the\u0026nbsp;web\u003c/h3\u003e\r\n\u003cp\u003eWhy is it so frequent that a teacher arrives at a new school only to learn that every other current foreign teacher has had problems with the management and/or dislikes the work environment, and that previous teachers had been in similar terms. When people look for restaurants, hotels and products, they look them up online before they commit to anything. Bad quality leads to a bad reputation which leads to bad reviews online and less sales. Companies are then forced to change, whether wholeheartedly or not. So why not apply the same logic to TEFL schools in China. Everyone has something to say about their job so why not take the time and share it on a website like \u003cstrong\u003e\u003ca href=\"../\"\u003eEnglish in China\u003c/a\u003e\u003c/strong\u003e. Given the right amount of users, a website like that would make it possible for future teachers to know exactly what they are jumping into and maybe push schools to try and work a little more on their reputation.\u003c/p\u003e","kicker":"It's time for some change","dateCreated":{"$date":"2017-03-01T13:36:46.276Z"},"__v":0}
