{"_id":{"$oid":"584a7c9f2726371100fedc25"},"name":"Shane English School","description":"Shane English is an internationally known brand with four decades of history. We are pioneers in multiple areas of the English-teaching industry and have English language centres in several countries. Our wealth of experience in education will provide you with what you need to reach your English-learning goals.\r\n\r\nExcellent Teaching Quality\r\n\r\nAt Shane English School, we recognise that everyone learns language differently. Our teachers adapt their English lessons to individual student’s needs. We focus on developing our students’ communicative proficiency in order to prepare them for real-life encounters with other English speakers.\r\nOur insistence on employing only 100% TEFL-certified English teachers, and following strict recruitment criteria, has ensured quality as the foundation of the system. With a recruitment and training centre in the heart of London, we are able to attract the very best candidates.\r\n\r\nWe believe the best way to learn English is to use it in real world scenarios. This is why the Communicative Method is used throughout Shane English Schools. In lessons students actively participate in discussions and activities that allow them to practise their English pronunciation and intonation.\r\nThis is often a very different method to what students are used to. However, research and our own extensive experience has shown that an active, communicative learning style in pairs or groups is extremely effective in helping students learn English. Due to the high-level of exposure to English, this method has been found to greatly improve students’ vocabulary, grammar and confidence.","website":"http://shaneschools.com","pictureUrl":"shane.jpg","logoUrl":"shaneenglishschoologo.png","photos":[{"$oid":"584a7c9f2726371100fedc26"},{"$oid":"584a7c9f2726371100fedc27"}],"__v":0}
{"_id":{"$oid":"5854fe710e15ad11008cfef7"},"name":"Aston Educational Group","description":"\u003cp\u003eAston English is the flagship division of The Aston Educational Group. Aston English came into being in the city of Dalian in 1996. From the humble beginning of a single school it has flourished into one of China\u0026rsquo;s largest ESL operators in China with over 90 schools in 100 cities across 22 provinces.\u003c/p\u003e\r\n\u003ch3\u003eLocations\u003c/h3\u003e\r\n\u003cp\u003eOur main concentration of schools are found in Sha\u0026rsquo;anxi and Shandong province, but we are pretty much spread across the whole of China, from Inner Mongolia to Guizhou, Xinjiang to Jiangsu. We have no schools in Beijing or Shanghai as our main focus has been to bring English to where the people in central China, in the smaller 2nd and 3rd tier cities.\u003c/p\u003e\r\n\u003ch3\u003eCurriculum \u0026amp; Syllabus\u003c/h3\u003e\r\n\u003cp\u003eWe have spent many years developing our own curriculum and syllabus. Our primary focus is on spoken and listening English with reading and writing as a secondary. Teachers will have full support with regard to text books. They are given a Teacher\u0026rsquo;s guide, Text book and Workbook for each level that they are responsible for teaching\u003c/p\u003e\r\n\u003ch3\u003eTraining and Development\u003c/h3\u003e\r\n\u003cp\u003eBefore teachers start their contract they are required to go on a 2 day compulsory training course called TCERT training. This is an induction and orientation course where the newly employed teachers are introduced to the course books and materials they will be using during the course of their employment. They will also have the opportunity to share ideas in workshops and do practice classes to get them warmed up and some initial classroom experience.\u003c/p\u003e\r\n\u003cp\u003eDuring the course of a teacher\u0026rsquo;s employment they will attend weekly workshops, be observed by managers and teacher trainers and have the opportunity to request coaching or observe peer classes to help them improve or develop as teachers.\u003c/p\u003e\r\n\u003ch3\u003eClass Levels\u003c/h3\u003e\r\n\u003cp\u003eWe have two level sets, Kindergarten and Pre School levels and then Primary school through to High school levels.\u003c/p\u003e\r\n\u003cp\u003eAston PC ClassThe Kindergarten and Pre-school levels are divided into two groups and the student ages range from 3 to 5 years old. The youngest level is called \u0026ldquo;Jungle Gym\u0026rdquo; which has 2 levels and is numbered accordingly, JG 1 and JG 2. The ages of these students are between 3 and 4.\u003c/p\u003e\r\n\u003cp\u003eAfter \u0026ldquo;Jungle Gym\u0026rdquo; we have \u0026ldquo;PC\u0026rdquo; classes. The \u0026ldquo;PC\u0026rdquo; classes have 4 levels; PC 1, 2, 3 and 4. The ages for these levels are between 5 and 6. \u0026ldquo;PC\u0026rdquo; stands for Parent Child, with both these levels there are 10 students in a class who are accompanied by their parents (The parent have no participation in class). The foreign teachers 30 minutes and is assisted by a Chinese teaching assistant. In PC 3 and 4 there are 12 students in class with no parents, the teaching time is the same and the foreign teacher is assisted by a Chinese teaching assistant.\u003c/p\u003e\r\n\u003cp\u003eAston ClassThe Primary school to High school levels is called \u0026ldquo;C\u0026rdquo; levels. The \u0026ldquo;C\u0026rdquo; levels are divided into the 4 levels of proficiency; Beginner, Elementary, Intermediate and Advanced. The students are placed in class according to their speaking proficiency so there may be a range of different ages in different classes. There are a total of 15 levels in the \u0026ldquo;C\u0026rdquo; levels with the youngest aged student being 7 and the oldest 18. The foreign teacher/Chinese teacher time depends on the proficiency level. Beginner and lower Elementary class time is divided 50/50 between the teachers, the foreign teacher teaches for 1 hour assisted by a Chinese teaching assistant. Aston ClassAfter the foreign teacher finishes their hour the Chinese teacher takes over and teaches another hour. The Upper Elementary/Lower Intermediate classes are split 75/25 with the foreign teacher teaching one and a half hours assisted by a Chinese teaching assistant and the last 30 minutes is taught by the Chinese teacher alone. The Upper Intermediate is taught 100% by the foreign teacher with the assistance of a Chinese teaching assistant for 2 hours and with the advanced levels the foreign teacher teaches a 2 hour class alone.\u003c/p\u003e\r\n\u003ch3\u003eFacilities \u0026amp; Classrooms\u003c/h3\u003e\r\n\u003cp\u003eThe Aston English classroom is very simple; each class has 18 desk chairs for the 18 students that will attend the class and a whiteboard or glass board. The younger levels have smaller furniture and are more geared towards the height of the attending small students. The Aston 3.0 classroom has the same amount of chairs but have interactive whiteboards installed with audio and video capabilities.\u003c/p\u003e","website":"http://www.astoneducation.com/","pictureUrl":"aston_3b-2423.jpg","logoUrl":"astonlogo.png","photos":[{"$oid":"5854fe720e15ad11008cfef8"},{"$oid":"5854fe720e15ad11008cfef9"}],"__v":0}
{"_id":{"$oid":"58563c3ca506ea1100d8aa2f"},"name":"English First (EF)","description":"\u003ch3\u003eAbout EF English First\u003c/h3\u003e\r\n\u003cp\u003eEF English First has been providing English language lessons for over 20 years in more than 300 English First schools across China, Russia and Indonesia. So whether you\u0026rsquo;re looking for a fast-paced city like Shanghai or the more offbeat rural experience, we probably have the English teaching position for you. Teaching English with EF English First is an experience you will never forget. We are looking for people from the United States, Canada, United Kingdom, Ireland, Australia and New Zealand to come and work abroad as English teachers. In return you will receive a great local salary, training and career progression. We will support you every step of the way from application to arrival, providing you with legal visas and arrival support.\u003c/p\u003e\r\n\u003cp\u003eEF English First is a division of EF Education First.\u003c/p\u003e\r\n\u003ch3\u003eAbout EF Education First\u003c/h3\u003e\r\n\u003cp\u003eEF Education First is the world\u0026rsquo;s leading privately owned education company. Founded in 1965, we are a group of more than 16 divisions and non-profit organizations centered around learning a language, educational travel, cultural exchange and International Business Management courses. Today EF Education First has over 43,500 employees, teachers and volunteers. With over 500 schools and offices in 53 countries, EF has turned the world into a global classroom. EF's mission is more timely than ever. Never before has it been so important to understand diverse ways of life and other cultures. EF remains committed to opening the world through education, whether that's in another country, around the corner from your home or office, or on the Internet.\u003c/p\u003e\r\n\u003ch3\u003eWorking in China\u003c/h3\u003e\r\n\u003cp\u003eEF\u0026rsquo;s English language schools are spread across China in over 60 cities. Teach English at our kids \u0026amp; teens schools, adult centers or at our online facility. Our schools are filled with the resources you need to be a great teacher. From internet-connected classrooms to lesson planning materials, you\u0026rsquo;ll be set from day one. Are you ready for the job of a life time? ESL jobs in China are unlike any professional experience. While your work hours and location might be unusual, you\u0026rsquo;ll be able to travel on weekends to exotic locations and learn a new language while teaching students who are engaged and active participants.\u003c/p\u003e\r\n\u003ch3\u003eTeaching English in China\u003c/h3\u003e\r\n\u003cp\u003eTaking a job teaching in China gives you the best of both worlds \u0026ndash; a strong career and an adventure. Jobs in China can be ranging, but at EF we make sure our teachers get exactly what they need. Whether it\u0026rsquo;s a five year professional growth track or a job to allow exploring another corner of the world, teaching English in China with EF makes life easy and worthwhile.\u003c/p\u003e\r\n\u003ch3\u003eGlobal Impact\u003c/h3\u003e\r\n\u003cp\u003eAs a world leading education company EF is committed to making a positive impact across the globe. EF supports good causes, pioneering research and international events that will leave a legacy for future generations.\u003c/p\u003e\r\n\u003cp\u003eEF founder Bertil Hult funds the global Hult Prize in partnership with The Clinton Global Initiative. The HULT prize encourages students from all over the world to find solutions to the world\u0026rsquo;s biggest challenges. Every year President Bill Clinton awards the winning team $1,000,000, as well as mentoring and support. The prize is to help the winning team implement their innovative ideas and solutions.\u003c/p\u003e\r\n\u003cp\u003eEducation First was chosen to be the Official Supplier of Language Programs at the Seoul Games in 1988. Since then the partnership has continued. EF has been the Official Language Provider in Beijing and Sochi, and is set to be the Official Language Provider in Rio 2016.\u003c/p\u003e\r\n\u003cp\u003eTo become a world leader in education, EF has established partnerships with Universities around the world. These partnerships ensure that EF is at the forefront of change. More importantly, this research is shaping learning for future generations.\u003c/p\u003e","website":"http://www.englishfirst.com/","pictureUrl":"efcover.jpg","logoUrl":"EFlogo.png","photos":[{"$oid":"58563c3ca506ea1100d8aa30"},{"$oid":"58563c3ca506ea1100d8aa31"}],"__v":0}
{"_id":{"$oid":"58569e5dd72b9511008b062f"},"name":"Web International English","description":"\u003cp\u003eWeb Education Group first opened its doors\u0026nbsp;in 1998, the goal to\u0026nbsp;provide Chinese people with a better and more effective way of learning English. To do this we created a unique Three-Stage Multi-Discipline Learning Method and combined it with one of the world\u0026rsquo;s most advanced courseware providers. Web was immediately successful and since founding has\u0026nbsp;established more than 72 centers across China, we've got centres in:\u0026nbsp;Shanghai, Guangzhou, Dalian, Chongqing, Hangzhou, Ningbo and many more.\u003c/p\u003e\r\n\u003cp\u003eThe working week is 40 hours, of which\u0026nbsp;25 hours are teaching. Classes are mostly small in size and have teaching materials prepared for you.\u0026nbsp;We keep the office duties are minimal; we don\u0026rsquo;t spend time correcting tests or homework or doing much lesson planning in the office.\u003c/p\u003e\r\n\u003cp\u003eLessons plans are already made for all Private and Salon Classes to make preparation easier.\u0026nbsp;Rather than long preparation times\u0026nbsp;teachers just have to review the lesson plan before class and review any vocabulary or grammar structures they are not familiar with.\u003c/p\u003e\r\n\u003cp\u003ePreparation for a Social Club may time, however, especially if it\u0026rsquo;s a topic of the teacher\u0026rsquo;s choosing and he or she needs to create the lesson plan and material. There may be other minor duties as well,\u0026nbsp;another member of our staff might need a teacher to perform a level test for a student, or a student might need a teacher to correct grammar of a presentation they\u0026rsquo;re preparing for presentation class.\u003c/p\u003e","website":"http://englishinchina.co/school/id/webi.com.cn","pictureUrl":"webiecover.jpg","logoUrl":"webielogo.jpg","photos":[{"$oid":"58569e5dd72b9511008b0630"},{"$oid":"58569e5dd72b9511008b0631"}],"__v":0}
{"_id":{"$oid":"5856ac94d72b9511008b0648"},"name":"Disney English","description":"\u003cp\u003e\u003cstrong\u003eAt Disney English\u003c/strong\u003e, you will experience a new culture, give the gift of language to children across China and work with a well-loved and global brand. In a career with Disney English you will have the opportunity to influence the lives of our young learners in unique ways by utilizing award-winning curriculum through storytelling, innovation and fun - while guiding them on the road to success. We invite you to learn, grow and succeed with a team that loves what they do. We invite you to be Disney.\u003c/p\u003e\r\n\u003cp\u003eOrientation usually starts on the Monday after arrival in China and is followed by 7 days of academic training. During orientation and training, cast members learn about Disney English, the content/curriculum, service standards and the interactive technology. Disney English provides a developed curriculum that is robust, engaging, and interactive and is inclusive of scope and sequence. Every lesson includes planned activities and targets. During training, new cast members will have the opportunity to practice and present lessons. Casual business attire is required for academic training.\u003c/p\u003e\r\n\u003cp\u003eForeign Trainers spend 40 hours per week in their centers, of which approximately 20-25 are contact hours. The remainder of the time is spent preparing lessons, conducting demonstration lessons for potential students and their parents to help market our program, hosting referral events, attending staff meetings and engaging in other center activities as needed. Academic cast members work a 5-day week, shifts do not start earlier than 8:30am and end no later than 9:00pm. Question: Will I have weekends off?\u003c/p\u003e\r\n\u003cp\u003eSaturdays and Sundays are Disney English's busiest (and longest days) at the centers. Cast members are required to work both days, and can expect that one of the days will have a 12-hour shift. Cast members will receive 2 consecutive days off during the week, to serve as a \"weekend\". Usually the days off are either Tuesday/Wednesday or Wednesday/Thursday.\u003c/p\u003e\r\n\u003ch3\u003eThe programs\u003c/h3\u003e\r\n\u003cp\u003eDisney English provides English classes for children ages 2 through 12 years old. \u003cstrong\u003eThere are 3 programs offered\u003c/strong\u003e:\u003c/p\u003e\r\n\u003cp\u003eHello World: 2 year olds\u003cbr /\u003eFoundation: 3-6 year olds\u003cbr /\u003eStep Up: 7 year olds +\u003c/p\u003e\r\n\u003cp\u003eNo class will exceed 15 learners. Using a team training approach, all Foreign Trainers are paired with a Chinese Learning Partner for all classroom time.\u003c/p\u003e\r\n\u003cp\u003eDisney English provides the TEFL-C course as a no cost benefit to all Foreign Academic cast members. All foreign academic staff at Disney English are TEFL-C (Teaching English as a Foreign Language to Children) certified. The program, which is affiliated with Columbia University Teachers' College, consists of 20 on-line modules. Foreign cast members MUST complete all 20 online modules prior to starting with Disney English. Once on-board, 15 hours of live training are provided, as part of on-boarding and training. The remaining 13 online modules MUST be completed within 3 months of arrival. The hard copies of the TEFL-C certificates will be provided upon completion of the course.\u003c/p\u003e\r\n\u003ch3\u003eLocations\u003c/h3\u003e\r\n\u003cp\u003eDisney English centers are currently opened in 9 cities throughout China\u0026mdash;\u003cstrong\u003eBeijing, Chengdu, Wuhan, Shanghai, Suzhou, Hangzhou, Nanjing, Guangzhou and Shenzhen\u003c/strong\u003e. Disney English will continue its expansion into other cities throughout China in the coming years.\u003c/p\u003e","website":"http://www.disneyenglish.com/","pictureUrl":"disneyenglish.jpg","logoUrl":"disney-english-squarelogo-1412193780545.png","photos":[{"$oid":"5856ac94d72b9511008b0649"},{"$oid":"5856ac94d72b9511008b064a"}],"__v":0}
