{"_id":{"$oid":"57369d52f3121390114afaa1"},"user":{"$oid":"573681838c574a3c23f74f4e"},"objectType":0,"foreignId":{"$oid":"573673127b489d50267d04df"},"comment":"My experience in New Zealand School as a whole is positive. Having worked at a training school prior to this job, I liked the atmosphere of a public school in which learning was the main priority. There is no convincing parents to sign for another year or pushing weaker students in advanced classes they clearly don't belong in. Most students know why they are there and international classes take English seriously. \r\n\r\nMy only hiccups were probably the increasing number and turnover rate of private classes that are given alongside the standard classes, since IELTS focused private classes are significantly more work than other classes yet this doesnt show at all in teaching hours. As well as the lack of compensation for teachers who don't choose to live in the provided apartment (there is only one apartment).\r\n\r\nAs far as responsibilies, academic resources and communication with the rest of the staff go, I've not had any bad experiences, but I know other teachers have. There were three foreign teachers when I started but one  was fired and the school hasn't replaced him, which after several months made me feel like somewhat isolated from the foreign community in Dongying.","anonymous":true,"position":1,"dateEmployed":{"$date":"2015-08-31T16:00:00.000Z"},"dateReleased":{"$date":"2016-08-30T16:00:00.000Z"},"average_rating":3.625,"criteria":{"c1":3,"c2":5,"c3":5,"c4":2,"c5":4,"c6":3,"c7":4,"c8":3},"dateCreated":{"$date":"2016-05-14T03:36:50.499Z"},"__v":6,"helpfuls":[{"user":{"$oid":"581fc83a7da1091100480cdb"},"_id":{"$oid":"581fc84f7da1091100480cdc"},"dateCreated":{"$date":"2016-11-07T00:18:23.440Z"}},{"user":{"$oid":"5832e3dd41d1c012002f7ae1"},"_id":{"$oid":"5832e6c541d1c012002f7ae6"},"dateCreated":{"$date":"2016-11-21T12:21:25.569Z"}},{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"5833923a8020a21200a4ca65"},"dateCreated":{"$date":"2016-11-22T00:32:58.612Z"}},{"user":{"$oid":"572571bd85c01350193df8f6"},"_id":{"$oid":"583a55984a296d1100d16e8f"},"dateCreated":{"$date":"2016-11-27T03:40:08.828Z"}},{"user":{"$oid":"58533783cbde811100e5f409"},"_id":{"$oid":"5853379fcbde811100e5f40a"},"dateCreated":{"$date":"2016-12-16T00:38:55.604Z"}},{"user":{"$oid":"575dfe9e86ad7811005d2922"},"_id":{"$oid":"5862948ec1e41b11002ac4b3"},"dateCreated":{"$date":"2016-12-27T16:19:26.757Z"}}]}
{"_id":{"$oid":"5739d336cd7873cc217f2a5a"},"user":{"$oid":"573681838c574a3c23f74f4e"},"objectType":0,"foreignId":{"$oid":"5739c9dccd7873cc217f2a56"},"comment":"Shane was a good first experience teaching in China. The support on arrival is decent as they have an employee whose tasks include helping out foreigners settle in, this employee will do anything from opening a bank account to looking for apartments all day with you. The school hires about 10 foreign teachers at all times, which is great because the same people who are your colleagues are often your friends in China! \r\n\r\nThere were no major issues with the school EXCEPT for management, which ultimately had a significant impact on my experience there. The school doesn't take the contract seriously, some of the clauses are there just for show(I had to fight to get the school-provided apartment which was in both contracts, the one they made me sign online, as well as the one I signed in person, they told me they just didn't have one at the time and I would have to pay for one myself). Any clause benefiting the school will be taken to the letter, but if it's the other way around you will probably be welcome by a \"foreigners are lazy\" mentality, or even insulted in Chinese by the manager. The school will also withhold your previous months money ( money already worked for!) in an attempt to have some semblance of control over you. It happened to a colleague who spent his vacation outside of China and would only be paid at his return.\r\n\r\nThat being said, it is a good school for its general atmosphere, there is a good vibe in the office and the many foreign teachers and Teacher's Assistants make for a lively work environment.","position":1,"dateEmployed":{"$date":"2014-02-28T16:00:00.000Z"},"dateReleased":{"$date":"2015-08-30T16:00:00.000Z"},"average_rating":3.25,"criteria":{"c1":4,"c2":1,"c3":5,"c4":4,"c5":4,"c6":3,"c7":1,"c8":4},"dateCreated":{"$date":"2016-05-16T14:03:34.368Z"},"__v":4,"helpfuls":[{"user":{"$oid":"581fc83a7da1091100480cdb"},"_id":{"$oid":"581fd0cfb75b0511005dbe8e"},"dateCreated":{"$date":"2016-11-07T00:54:39.878Z"}},{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"583392108020a21200a4ca5f"},"dateCreated":{"$date":"2016-11-22T00:32:16.471Z"}},{"user":{"$oid":"572571bd85c01350193df8f6"},"_id":{"$oid":"583a55814a296d1100d16e8b"},"dateCreated":{"$date":"2016-11-27T03:39:45.788Z"}}]}
{"_id":{"$oid":"57600b10fe87bb110089fd7c"},"user":{"$oid":"575e6166993362110033cc49"},"objectType":0,"foreignId":{"$oid":"5739c9dccd7873cc217f2a56"},"comment":"My time at Shane school was both good and bad. The curriculum is setup very good for teaching spoken English. I learned a lot working for the school. \r\nThe TAs are very helpful and fun to work with. \r\nBut a warning with the management. They run the school like a dictatorship. Do as they say and don't tell them when they do something wrong. Be ready to have your holidays days taken and work the classes later. The management will twist everything to be in the schools favor. They will change the contact over and over to get the most out of the teachers while giving back as little as possible. \r\nThe people in charge of your visa are power hungry and petty. \r\nWhen dealing with the management anything you want changed you need to get in writing and signed by them or it will never happen. \r\nThe school will tell you that if they don't schedule you full hours every month it is not your fault but then they will rub it in your face every time they want you to work over your time the next month and not pay you for it. \r\nIf the school could they will make you work for free for all the hours they never gave you for the year. I would not be surprised if the new contract they make said you work for a year but any hours missed will be added to time at the end of the contract that you have to work for free because they payed you the full salary already but you did not do the full hours. \r\nWhen I was with the school for the two years they changed the hours in the contract three or four times trying to word it so they can work you as much as they want and not pay. \r\nIf it is left up to them you could work 10 hours for the first three weeks of the month then have to work 70 for the last week. They think this is a normal and agreeable idea. \r\nAll in all if not for the management the school could be a great place to work. But sadly it is them that makes it hard. If you can stomach working for a dictator and just do your job no questions asked you will do great. ","position":-1,"dateEmployed":{"$date":"2014-04-30T00:00:00.000Z"},"dateReleased":{"$date":"2016-04-15T00:00:00.000Z"},"average_rating":3,"criteria":{"c1":4,"c2":1,"c3":4,"c4":4,"c5":5,"c6":2,"c7":1,"c8":3},"dateCreated":{"$date":"2016-06-14T13:48:00.917Z"},"__v":2,"helpfuls":[{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"583392138020a21200a4ca60"},"dateCreated":{"$date":"2016-11-22T00:32:19.067Z"}},{"user":{"$oid":"572571bd85c01350193df8f6"},"_id":{"$oid":"583a55834a296d1100d16e8c"},"dateCreated":{"$date":"2016-11-27T03:39:47.576Z"}},{"user":{"$oid":"575dfe9e86ad7811005d2922"},"_id":{"$oid":"5aeb2853838a8a06349499fc"},"dateCreated":{"$date":"2018-05-03T15:18:43.503Z"}}]}
{"_id":{"$oid":"576214e2a6155a1100784920"},"user":{"$oid":"576212fba6155a110078491f"},"objectType":0,"foreignId":{"$oid":"573673127b489d50267d04df"},"comment":"I liked the school overall. The colleages were professional and welcoming. The school gave me a change to learn teach. Dongying is a small city so the location is remote but the cost of living is cheaper than most of china. The city has an airport but no high speed train station. ","position":1,"dateEmployed":{"$date":"2015-09-01T00:00:00.000Z"},"dateReleased":{"$date":"2015-11-27T00:00:00.000Z"},"average_rating":3.25,"criteria":{"c1":4,"c2":3,"c3":3,"c4":5,"c5":2,"c6":4,"c7":2,"c8":3},"dateCreated":{"$date":"2016-06-16T02:54:26.565Z"},"__v":4,"helpfuls":[{"user":{"$oid":"5832e3dd41d1c012002f7ae1"},"_id":{"$oid":"5832e6c841d1c012002f7ae7"},"dateCreated":{"$date":"2016-11-21T12:21:28.897Z"}},{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"5833923c8020a21200a4ca66"},"dateCreated":{"$date":"2016-11-22T00:33:00.208Z"}},{"user":{"$oid":"572571bd85c01350193df8f6"},"_id":{"$oid":"583a55974a296d1100d16e8e"},"dateCreated":{"$date":"2016-11-27T03:40:07.444Z"}},{"user":{"$oid":"58533783cbde811100e5f409"},"_id":{"$oid":"585337a0cbde811100e5f40b"},"dateCreated":{"$date":"2016-12-16T00:38:56.946Z"}},{"dateCreated":{"$date":"2018-04-30T21:48:17.819Z"},"_id":{"$oid":"5ae78f2139a60f2bfc1b96ee"},"user":{"$oid":"575dfe9e86ad7811005d2922"}}]}
{"_id":{"$oid":"576340e7ff09ef1100995f8f"},"user":{"$oid":"57622ea8ff09ef1100995f8e"},"objectType":0,"foreignId":{"$oid":"574149b67ed338880e319469"},"comment":"Foreign Teachers live at the smaller Shengli College campus across the road from the West Gate of the China Petroleum University (UPC) Campus. None of the flats have their own kitchen, and they are typically pretty small. About the same size as an efficiency apartment in the US. The contract includes a free computer, printer, and internet access in the flat. Don't take the computer it will be a Chinese system riddled with viruses. WiFi Routers are about 100 RMB, so you can set up your own WiFi easily. There is a shared kitchen on the first floor, but it isn't well stocked with dishes and has a mould problem.  However, the North Gate of Shengli College has a large variety of foods (all Chinese except one knock off McDonald's/KFC place) that are all really cheap. There is apparently more hotel like foreign teacher accommodations at the UPC campus, which has a possibility of being where you'll live. Foreign Teachers at the school currently are teaching English Majors and Chinese as a Second Language Majors. The most classes I have been given from the College is 6 classes (when I started at the college there were 4 teachers and I had less classes), currently there are three foreign teachers. If the school goes down to two foreign teachers than teaching hours may go up or if they lose a Chinese English teacher the foreigners maybe given those classes as well. The current contract is for 16 hours per week including a 1 hour English Corner once a week (This term I am teaching 13 hours a week: 6 two hour classes and 1 one hour English Corner). Our English Corner isn't structured we just stand outside one of the teaching buildings or if it is raining or cold just inside the door to the same building. Each class year in a major (so far, since I've been at the school) has had two classes. So if you teach 2nd year Oral English class for English Majors you should have two classes; which means the same lesson twice. Each class is two 50 minute halves with a 10 minute break in between. There is supposed to be 16 weeks in a semester, when they make the calendar they include the vacation days and expect you to make the classes up after or before the break or they will reschedule your classes for a Saturday or Sunday; this is pretty on par for China. Foreign Teachers don't really talk too much with our Chinese Colleagues unless you play a sport like Tennis or Badminton. The school is changing as the Chinese Government is trying to weed out corruption, the English department used to have a big Christmas party for the teachers, but that is on the decline (as it could be seen as trying to buy the teachers). The school doesn't give you any materials. They did give me a Listening English Textbook my first year, but the audio CD that came with it was hard for me to understand so I didn't use the book. The school doesn't really care what you teach the students. Although they are college students you should avoid conversations about sex, drugs, Chinese history after 1912, politics, and religion. Though Politics and Religion are cool as long as you talk about your country, and your religion as it pertains to you, or religions not in relation to China. The classes that foreign teachers are currently teaching are Oral English, Listening English, Writing, and Business English. You need to make, give, and mark your own exam. If you teach listening you'll need to combine the classes in the same year for the exam or write two exams so each class has a different exam, so they won't cheat (They'll cheat anyways, up to you whether you care or not). You can organise your marks however you want, you must enter them into the school's system as 30% of the final mark as participation and 70% for the final exam. 60 is the lowest passing grade and any student that fails your class will only have to take the final exam for the class the next year. We teach freshman through 3rd years. The freshman start a month late however, because they all have to do military training on campus in September, and you are supposed to make up those classes that would have occurred in September the largest class I have had in either English or Chinese majors was almost 40 students and the smallest was 22 students. When I started working at the school the English Majors were on the Shengli Campus and the Chinese Majors were on the UPC Campus. Last year they were both at the UPC campus and this year the Chinese Majors are on the Shengli Campus and the English Majors are on the UPC Campus. The Foreign Teacher's flat building is on the Shengli Campus surrounded by student dorms, close to the Shengli College East gate (across the street from the UPC Campus West Gate). So it could take you anywhere from 2 minutes (Shengli Campus) to 15 minutes (UPC Campus) to walk to your classes. The school may ask you to teach extra classes on the weekend that you will get paid extra for (though that hasn't happened in a couple years). You will be working for the oil field; so I've taught Doctors who were going to Houston Texas (another Oil city) English, and Oil Workers headed to Houston, Canada, or the Middle East English. You can always say no to those extra jobs. In general the job is pretty lax, not a lot of work and a good amount of free time. Getting straight answers from the school can be like pulling teeth, and management can be a bit annoying at times. You will get about 6 weeks off for Spring Festival and summer, which you’ll know about ahead of time as those are the breaks between semesters. The pay is lower than training schools but so is the work load. The campus doesn't really look like it is in a central spot, but it is within walking distance to the big Wanda Plaza that has the IMax and a Starbucks and a bunch of other shopping centres/supermarkets there is also a couple good bus routes that will get you to the bus station, the main cheap shopping area, the slow train station, and the East half of the city. It is a good school to work for as long as anything I mentioned above isn't going to bother you too much.","position":1,"dateEmployed":{"$date":"2012-09-01T00:00:00.000Z"},"dateReleased":{"$date":"2017-07-15T00:00:00.000Z"},"average_rating":3.75,"criteria":{"c1":4,"c2":3,"c3":2,"c4":3,"c5":5,"c6":5,"c7":4,"c8":4},"dateCreated":{"$date":"2016-06-17T00:14:31.651Z"},"__v":2,"helpfuls":[{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"583391fc8020a21200a4ca5e"},"dateCreated":{"$date":"2016-11-22T00:31:56.744Z"}},{"user":{"$oid":"575dfe9e86ad7811005d2922"},"_id":{"$oid":"58564d6ba506ea1100d8aa32"},"dateCreated":{"$date":"2016-12-18T08:48:43.602Z"}}]}
{"_id":{"$oid":"576bd9ba23d54a11007e83a0"},"user":{"$oid":"576bcbfc23d54a11007e839f"},"objectType":0,"foreignId":{"$oid":"574146ab7ea1d71100ad3236"},"comment":"I worked at westcity EF for two months and then transferred to east city. It was my first job after graduation. There is pressure in private training schools like that you should keep as many as students in a class and keep their parents satisfied cuz they have paid a certain amount of money for school.\r\nThe students age range was from around 5 to 15. Each class had about 10 students. But they don't necessarily start at the same time. Sometimes you'll have one or two students at similar level get into the classes that you have already started. \r\nNot all the students will be well behaved in class. As a TA also as a teacher,sometimes you'll have to spend much time on disciplining kids as a babysitter especially when they are little. \r\nThe colleagues were nice and some of the foreign teachers I have worked with are my friends now.  Some of them have already gone. You'll have to accept the fact that it's hard to have stable foreign friends here cuz most of them will leave China or Dongying in a couple of years.\r\nThe environment in the office was pleasant. People are helpful. There are people help with foreign teachers with there arrival,apartment and other stuff like this.\r\nAlso because it's training school, you'll have different days off with other people. Generally you will have Tuesday and Wednesday off . And if there's a holiday,the days will be arranged differently. In summer or winter holidays,you will have an intense course lasts for one to two weeks. You'll have more classes and more students. Sometimes you'll have to do special activities for that. And also the demo classes are important cause it'll have more parents sign up for school.\r\nIt's a training school that is similar with Shane. So if you had such experience at this kind of school,you'll have no trouble with this one.  ","position":2,"dateEmployed":{"$date":"2012-08-01T00:00:00.000Z"},"dateReleased":{"$date":"2013-01-01T00:00:00.000Z"},"average_rating":3.25,"criteria":{"c1":3,"c2":3,"c3":3,"c4":4,"c5":4,"c6":2,"c7":3,"c8":4},"dateCreated":{"$date":"2016-06-23T12:44:42.030Z"},"__v":1,"helpfuls":[{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"5833922c8020a21200a4ca64"},"dateCreated":{"$date":"2016-11-22T00:32:44.812Z"}}]}
{"_id":{"$oid":"577618d7aa70271100c98c91"},"user":{"$oid":"577615f0aa70271100c98c8f"},"objectType":0,"foreignId":{"$oid":"574149b67ed338880e319469"},"comment":"Shengli College (it's almost entirely unrelated to UPC so don't make that mistake) is probably the most laid-back job you could ever find.\r\nI get ridiculous time off and often have 10 or less hours each week plus I haven't worked a day in Jan/Feb/Jul/Aug in my 4 years here.\r\nThere's no oversight AT ALL.  In 4 years I have been observed exactly twice and both times it was someone just coming in to watch the students do their final presentations.\r\nThe extent of the instructions that I've been given are as follows: \"teach them English\".\r\nSo, if you like complete autonomy then this job is amazing.  If you like some structure and support then you'll hate it.\r\nOverall this has been an amazing job.  I really don't know many people who I'd switch jobs with.  The low ratings I gave are only because a lot of the dynamics simply do not exist at all.  There are times where I won't hear from any of the management or Chinese teachers for months.  I'm fine with that but if you're looking for more integration it's not ideal.","position":1,"dateEmployed":{"$date":"2011-09-01T00:00:00.000Z"},"dateReleased":{"$date":"2016-07-15T00:00:00.000Z"},"average_rating":3.375,"criteria":{"c1":3,"c2":5,"c3":0,"c4":4,"c5":5,"c6":4,"c7":4,"c8":2},"dateCreated":{"$date":"2016-07-01T07:16:39.195Z"},"__v":2,"helpfuls":[{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"583391fb8020a21200a4ca5d"},"dateCreated":{"$date":"2016-11-22T00:31:55.055Z"}},{"user":{"$oid":"572571bd85c01350193df8f6"},"_id":{"$oid":"583a55ad4a296d1100d16e90"},"dateCreated":{"$date":"2016-11-27T03:40:29.406Z"}}]}
{"_id":{"$oid":"577723a9b5a3ee11001e8ca8"},"user":{"$oid":"5777206eb5a3ee11001e8ca7"},"objectType":0,"foreignId":{"$oid":"573673127b489d50267d04df"},"comment":"Good school.   Classes are mostly no nonsense, however the domestic students are so mixed that having active classes is almost impossible.  The international leader Harry is a joy to work with,  very reasonable and understanding of class dynamics and student expectations.   The principal  is kind,  however,  speaks no English.   Her,  and the director. A nice man named Lawremce, gave speeches at my wedding and also visited my wife and newborn baby in hospital.  The school is constantly giving teachers presents which are nice and thoughtful.   The English department office is very spacious with many teaching resources.  And for the most part,  the Chinese staff are kind and considerate. The recruitment officer leaves much to be desired in terms of being the liason between the contract and the school.  Record every conversation because truth and integrity,  in that room go only as far as they serve her purposes.  My only problem at the school came this year when a teacher was fired and I was expected to exceed my contract hours significantly every week. I'm certain I would have still been working there for years to come had contract hours been respected.   A great school, good staff,  challenging work,  decent pay.   Again,  just be careful when dealing with the recruitment officer.   Good luck.\r\n  ","position":1,"dateEmployed":{"$date":"1970-01-01T00:00:00.000Z"},"dateReleased":{"$date":"1970-01-01T00:00:00.000Z"},"average_rating":2.875,"criteria":{"c1":4,"c2":3,"c3":4,"c4":1,"c5":3,"c6":3,"c7":2,"c8":3},"dateCreated":{"$date":"2016-07-02T02:15:05.858Z"},"__v":2,"helpfuls":[{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"5833923d8020a21200a4ca67"},"dateCreated":{"$date":"2016-11-22T00:33:01.696Z"}},{"user":{"$oid":"58533783cbde811100e5f409"},"_id":{"$oid":"585337b2cbde811100e5f40c"},"dateCreated":{"$date":"2016-12-16T00:39:14.144Z"}},{"dateCreated":{"$date":"2018-04-30T21:49:19.456Z"},"_id":{"$oid":"5ae78f5f79127c1d20096aad"},"user":{"$oid":"575dfe9e86ad7811005d2922"}}]}
{"_id":{"$oid":"577727f5b5a3ee11001e8ca9"},"user":{"$oid":"5777206eb5a3ee11001e8ca7"},"objectType":0,"foreignId":{"$oid":"5739c9dccd7873cc217f2a56"},"comment":"Good first school for a teacher to get experience.  At the time the head teacher,  a man named Neil took his job very seriously and took new teachers under his wing to make excellent classes for students.   Unfortunately now there is a young man who has too many titles and irons in the fire to accommodate the needs of so many new teachers so often.   I feel for him because the school has had so much turnover in staff its Nearly impossible to get emotionally attached to recruits.   The curriculum and setup of the classes is somewhat haphazard.  Mixed classes with two or three  Jim the walking vegetables drooling in the classes amidst good and sincere students, really jamming up the works.   The resources are excellent and the Chinese assistants are all pretty great. However,  beware the duplicity and forked to MN goes of managenent, specifically THE manager who shall go unnamed.   If a lie will serve her purposes, it will be spoken with vigor, tears,  joy,  or whatever manipulative emotion better triggers her dark ends.  U are not a person with a life,  a soil,  dreams,  desires,  humanity.   You are a limp pawn that is to be moved wherever,  whenever, and whyever said tyrant desires.   ","position":1,"dateEmployed":{"$date":"1970-01-01T00:00:00.000Z"},"dateReleased":{"$date":"1970-01-01T00:00:00.000Z"},"average_rating":2.875,"criteria":{"c1":5,"c2":2,"c3":4,"c4":0,"c5":5,"c6":3,"c7":0,"c8":4},"dateCreated":{"$date":"2016-07-02T02:33:25.855Z"},"__v":1,"helpfuls":[{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"583392148020a21200a4ca61"},"dateCreated":{"$date":"2016-11-22T00:32:20.333Z"}},{"user":{"$oid":"575dfe9e86ad7811005d2922"},"_id":{"$oid":"5ae79aba3e7cc705dcfab462"},"dateCreated":{"$date":"2018-04-30T22:37:46.486Z"}}]}
{"_id":{"$oid":"57900291a18b8911002952af"},"user":{"$oid":"578ffd56a18b8911002952ae"},"objectType":0,"foreignId":{"$oid":"5739c9dccd7873cc217f2a56"},"comment":"I agree with most of the reviews that have already been written about this school so I will try not to restate what has already been said. It is a great stepping stone and a way to learn more about teaching English as a foreign language. There are opportunities for you to develop yourself in the form of workshops, and although I hated them at the time, having spent some time in other schools, now I realize how much they really allowed me to grow and develop my teaching style. They also (at least when I was there) provide a free Mandarin class once a week which helps you a lot, because no one there (except the other foreigners) speak any English. It was sometimes difficult for me to reason with management and get across whatever it was that I needed them to understand but on the whole that has been a common problem for me at other schools as well. This school also provided most of the teaching materials that I needed in the form of books, classroom materials and flashcards. The city this school is situated in is very small so don't expect to be partying everyday, but with that said there are some foreign food places about 30 minutes away by taxi. I really loved my colleagues and they made it worth while for me to work and live in this city. On the whole I am really glad for the time that I got to spend there.","position":1,"dateEmployed":{"$date":"2014-04-01T00:00:00.000Z"},"dateReleased":{"$date":"2014-08-30T00:00:00.000Z"},"average_rating":4,"criteria":{"c1":5,"c2":3,"c3":4,"c4":4,"c5":4,"c6":4,"c7":3,"c8":5},"dateCreated":{"$date":"2016-07-20T23:00:33.464Z"},"__v":2,"helpfuls":[{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"583392158020a21200a4ca62"},"dateCreated":{"$date":"2016-11-22T00:32:21.878Z"}},{"user":{"$oid":"572571bd85c01350193df8f6"},"_id":{"$oid":"583a55844a296d1100d16e8d"},"dateCreated":{"$date":"2016-11-27T03:39:48.909Z"}}]}
{"_id":{"$oid":"5815dabac895d2110050227e"},"user":{"$oid":"5815d873c895d2110050227d"},"objectType":0,"foreignId":{"$oid":"5739c9dccd7873cc217f2a56"},"comment":"Academic resources - One of the beautiful things about this job is its simplicity. All the resources are easily accessible and simple to use. \r\nAccommodation - I choose to flat share with another foreign teacher and our apartment was within walking distance of the school. Thankfully pets have now been banned from these apartments so as long as you aren’t too unlucky with your housemate you shouldn’t have many complaints.  \r\nLocation - The school is located in east city whereas most foreigners in Dongying live in west. However getting a taxi across to west is cheap and doesn’t take long. \r\nAccessibility - Teaching at Shane east gives you access to an incredible number of opportunities. Once you have some experience there are endless job prospects for teachers in China and I think this school is a great place to start.\r\nSalary, and cost of living - The salary for a teacher at Shane east is brilliant. I was able to save around half my wage every month, whilst living a fantastic lifestyle. You really can live like a king!!! \r\nWorkload – The normal working schedule is unbelievably good for foreign teachers, with most of your working hours squeezed into the weekends. Once you have got through the first few weeks of teaching this job will probably become one of the easiest and most rewarding you’ll ever have. \r\nValue of contract / Environment and management- These are the two categories where most foreign teachers rightly have an issue with the school. For me personally I was able to deal with my disputes easily enough but I don’t think this was true for many. Clashes over contracts definitely created a lack of trust between certain foreigners and management, which doesn’t reflect well on the school. \r\nSupport on arrival - I think the school should pay more attention to ensuring that new foreign teachers are properly settled. It shouldn’t be up to the foreign teachers to do this on behalf of the school.\r\nDynamic amongst teachers – Ninety percent of the teachers at Shane east were very genuine and I met some of my best mates in this job. The other ten percent are sadly the only significant negatives that I take from my experience at the school. \r\nThe kids - Wow!!! I can’t put into words how great it was to work where you’re given so much love and appreciation from the kids. They are without a doubt the best thing about this job and the buzz you get from working with them is extremely difficult to replace.\r\n","position":1,"dateEmployed":{"$date":"2015-05-01T00:00:00.000Z"},"dateReleased":{"$date":"2016-08-07T00:00:00.000Z"},"average_rating":4.125,"criteria":{"c1":3,"c2":4,"c3":5,"c4":5,"c5":5,"c6":5,"c7":3,"c8":3},"dateCreated":{"$date":"2016-10-30T11:34:18.872Z"},"__v":1,"helpfuls":[{"user":{"$oid":"573681838c574a3c23f74f4e"},"_id":{"$oid":"583392178020a21200a4ca63"},"dateCreated":{"$date":"2016-11-22T00:32:23.409Z"}}]}
{"_id":{"$oid":"5856868db2a37011003c2dce"},"user":{"$oid":"585683f7b2a37011003c2dcb"},"objectType":0,"foreignId":{"$oid":"58568520b2a37011003c2dcc"},"comment":"Within our program things run fairly smoothly. I work in the American program and we have an American principal, she does her best to make sure the school is honoring our contract and we are not having to do anything unreasonable. The school is about 30/45 minutes away from downtown Guangzhou by cab. We're provided with decent apartments that are on campus. We're paid the equivalent of what we would be making teaching the same subjects in the states.","position":1,"dateEmployed":{"$date":"2025-01-08T00:00:00.000Z"},"dateReleased":{"$date":"1970-01-01T00:00:00.000Z"},"average_rating":3.875,"criteria":{"c1":5,"c2":2,"c3":4,"c4":5,"c5":3,"c6":5,"c7":3,"c8":4},"helpfuls":[{"user":{"$oid":"5a0cad55b991b111004599a9"},"_id":{"$oid":"5a0cad9cb991b111004599aa"},"dateCreated":{"$date":"2017-11-15T21:11:56.485Z"}}],"dateCreated":{"$date":"2016-12-18T12:52:29.592Z"},"__v":1}
{"_id":{"$oid":"5af4a6afc8456e079ccf31ca"},"user":{"$oid":"575dfe9e86ad7811005d2922"},"objectType":0,"foreignId":{"$oid":"5837e33232ef971200bb09b9"},"comment":"","position":1,"dateEmployed":{"$date":"2018-05-20T04:00:00.000Z"},"dateReleased":{"$date":"2018-05-20T04:00:00.000Z"},"average_rating":2,"criteria":{"c1":2,"c2":2,"c3":2,"c4":2,"c5":2,"c6":2,"c7":2,"c8":2},"helpfuls":[],"dateCreated":{"$date":"2018-05-10T20:08:15.571Z"},"__v":0}
{"_id":{"$oid":"5af4c17a78a1d934cc087a05"},"user":{"$oid":"575dfe9e86ad7811005d2922"},"objectType":0,"foreignId":{"$oid":"5739c9dccd7873cc217f2a56"},"comment":"","position":1,"dateEmployed":{"$date":"2018-05-20T04:00:00.000Z"},"dateReleased":{"$date":"2018-05-20T04:00:00.000Z"},"average_rating":2,"criteria":{"c1":2,"c2":2,"c3":2,"c4":2,"c5":2,"c6":2,"c7":2,"c8":2},"helpfuls":[{"user":{"$oid":"575dfe9e86ad7811005d2922"},"_id":{"$oid":"5afae8053abd5043c8a97455"},"dateCreated":{"$date":"2018-05-15T14:00:37.106Z"}}],"dateCreated":{"$date":"2018-05-10T22:02:34.752Z"},"__v":0}
{"_id":{"$oid":"5afaf4383abd5043c8a97456"},"user":null,"objectType":0,"foreignId":{"$oid":"573673127b489d50267d04df"},"comment":"","position":1,"dateEmployed":{"$date":"2018-01-20T05:00:00.000Z"},"dateReleased":{"$date":"2018-11-20T05:00:00.000Z"},"average_rating":3.5,"criteria":{"c1":4,"c2":4,"c3":2,"c4":2,"c5":4,"c6":5,"c7":5,"c8":2},"helpfuls":[],"dateCreated":{"$date":"2018-05-15T14:52:40.791Z"},"__v":0}
{"_id":{"$oid":"5afd8d0ad13ac741b498e99f"},"user":{"$oid":"575dfe9e86ad7811005d2922"},"objectType":0,"foreignId":{"$oid":"573673127b489d50267d04df"},"comment":"","position":1,"dateEmployed":{"$date":"2018-05-20T04:00:00.000Z"},"dateReleased":{"$date":"2018-07-20T04:00:00.000Z"},"average_rating":2,"criteria":{"c1":2,"c2":2,"c3":2,"c4":2,"c5":2,"c6":2,"c7":2,"c8":2},"helpfuls":[],"dateCreated":{"$date":"2018-05-17T14:09:14.392Z"},"__v":0}
{"_id":{"$oid":"5afdc8a025c11c2454026e87"},"user":{"$oid":"575dfe9e86ad7811005d2922"},"objectType":0,"foreignId":{"$oid":"5afdc84c25c11c2454026e85"},"comment":"","position":1,"dateEmployed":{"$date":"2018-05-20T04:00:00.000Z"},"dateReleased":{"$date":"2018-05-20T04:00:00.000Z"},"average_rating":2,"criteria":{"c1":2,"c2":2,"c3":2,"c4":2,"c5":2,"c6":2,"c7":2,"c8":2},"helpfuls":[],"dateCreated":{"$date":"2018-05-17T18:23:28.947Z"},"__v":0}
{"_id":{"$oid":"5afdcc2125c11c2454026e8c"},"user":{"$oid":"5ad94d08a13a993a98c259aa"},"objectType":0,"foreignId":{"$oid":"5afdcbbd25c11c2454026e8a"},"comment":"","position":1,"dateEmployed":{"$date":"2018-05-20T04:00:00.000Z"},"dateReleased":{"$date":"2018-10-20T04:00:00.000Z"},"average_rating":3.75,"criteria":{"c1":2,"c2":2,"c3":2,"c4":5,"c5":5,"c6":5,"c7":5,"c8":4},"helpfuls":[],"dateCreated":{"$date":"2018-05-17T18:38:25.274Z"},"__v":0}
{"_id":{"$oid":"5b22dfb3af03de37f0c5a984"},"user":null,"objectType":0,"foreignId":{"$oid":"581b3c53e27cff1100ece397"},"comment":"","position":1,"dateEmployed":{"$date":"2018-06-20T04:00:00.000Z"},"dateReleased":{"$date":"2018-06-20T04:00:00.000Z"},"average_rating":2,"criteria":{"c1":2,"c2":2,"c3":2,"c4":2,"c5":2,"c6":2,"c7":2,"c8":2},"helpfuls":[],"dateCreated":{"$date":"2018-06-14T21:35:47.292Z"},"__v":0}
